mysource/public-notes-org/2023-11-15-org-mode-properties-reuse2.org
** Idea 10
Globalne wlasnosci

#+begin_src org :tangle (concat (org-entry-get nil "PRJ-DIR" t) "Ex10.org") :mkdirp yes :exports both

,#+INCLUDE: ./mymacros.org
,#+MACRO: AnotherComposer Vivaldi

,* Section about src_elisp{(org-entry-get nil "Name")} from {{{town}}} :this:
:PROPERTIES:
:Name:     J.S. Bach
:END:

,* Section about src_elisp{(org-entry-get nil "Composer")} and {{{mymacro}}} :this:
:PROPERTIES:
:Composer:     W.A. Mozart
:END:

,* Code
,#+begin_src elisp :eval yes :results output :exports both

   (defun replace-in-string (what with in)
	(replace-regexp-in-string (regexp-quote what) with in nil 'literal))

   (defun remove-text-up-to-asterisk (text)
	"Remove text from the beginning of the line to the first asterisk."
	(when (string-match "\\*" text)
	  (setq text (substring text (match-end 0))))
	text)

   (defun level1-headlines-filter ()
	(let (headline props)
	  (setq headline (org-entry-get nil "ITEM"))
	  (setq props (org-get-entry))
	  (setq string 
		(string-trim ;replace-in-string "\n" "" 
		  ;(replace-in-string "* " "" 
		  (remove-text-up-to-asterisk
		  (replace-in-string "=" "" 
		  (org-export-string-as 
		    (concat "#+INCLUDE: mymacros.org" "\n" 
			    "* " headline "\n" props) 
		    'org t '(:with-toc nil)))))) ;)
	   ))

	(setq HEADLINES-PARSED (org-map-entries #'level1-headlines-filter "LEVEL=1+this") )

	(print HEADLINES-PARSED)


   (org-entry-get (org-element-at-point) "AnotherComposer")
,#+end_src

,* Example
:PROPERTIES:
:hellomessage: hello
:END:

,#+NAME: get_property
,#+BEGIN_SRC elisp :var prop=""
	(org-entry-get nil prop t)
,#+END_SRC
,#+RESULTS: get_property

,#+BEGIN_SRC emacs-lisp :noweb yes
	(print "<<get_property("hellomessage")>>")
,#+END_SRC

,#+RESULTS:
: hello

,#+BEGIN_SRC emacs-lisp :noweb yes
	(print "<<get_property("AnotherComposer")>>")
,#+END_SRC  

,#+RESULTS:
: Vivaldi

A tu przykład użycia inline:
src_elisp[:noweb yes]{(print "<<get_property("AnotherComposer")>>")} 

#+end_src






** Useful links:


* COMMENT Local Variables

# Local Variables:
# eval: (setq org-latex-pdf-process
#  '("pdflatex -shell-escape -synctex=1 -interaction=nonstopmode -output-directory %o %f"
#    "pdflatex -shell-escape -synctex=1 -interaction=nonstopmode -output-directory %o %f"
#    "pdflatex -shell-escape -synctex=1 -interaction=nonstopmode -output-directory %o %f"))
# End:
 
